{
  "_name_or_path": "tgool/kobert",
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "finetuning_task": "fancy-ner",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "UNK",
    "1": "O",
    "2": "FOOD-B",
    "3": "FOOD-I",
    "4": "QTY-B",
    "5": "QTY-I",
    "6": "UNIT-B",
    "7": "UNIT-I"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "FOOD-B": 2,
    "FOOD-I": 3,
    "O": 1,
    "QTY-B": 4,
    "QTY-I": 5,
    "UNIT-B": 6,
    "UNIT-I": 7,
    "UNK": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.42.4",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 8002
}
